Revit 2024 API
ConnectionValidationWarning Class
 Contains information about a specific connection validation problem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class ConnectionValidationWarning : IDisposable
Visual Basic
Public Class ConnectionValidationWarning _
	Implements IDisposable
Visual C++
public ref class ConnectionValidationWarning : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ConnectionValidationWarning
See Also
ConnectionValidationWarning Members
Autodesk.Revit.DB Namespace